{
  "_name_or_path": "xlnet-base-cased",
  "architectures": [
    "XLNetForTokenClassification"
  ],
  "attn_type": "bi",
  "bi_data": false,
  "bos_token_id": 1,
  "clamp_len": -1,
  "d_head": 64,
  "d_inner": 3072,
  "d_model": 768,
  "dropout": 0.1,
  "end_n_top": 5,
  "eos_token_id": 2,
  "ff_activation": "gelu",
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-ORG",
    "4": "I-ORG",
    "5": "B-LOC",
    "6": "I-LOC",
    "7": "B-ANIM",
    "8": "I-ANIM",
    "9": "B-BIO",
    "10": "I-BIO",
    "11": "B-CEL",
    "12": "I-CEL",
    "13": "B-DIS",
    "14": "I-DIS",
    "15": "B-EVE",
    "16": "I-EVE",
    "17": "B-FOOD",
    "18": "I-FOOD",
    "19": "B-INST",
    "20": "I-INST",
    "21": "B-MEDIA",
    "22": "I-MEDIA",
    "23": "B-MYTH",
    "24": "I-MYTH",
    "25": "B-PLANT",
    "26": "I-PLANT",
    "27": "B-TIME",
    "28": "I-TIME",
    "29": "B-VEHI",
    "30": "I-VEHI"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ANIM": 7,
    "B-BIO": 9,
    "B-CEL": 11,
    "B-DIS": 13,
    "B-EVE": 15,
    "B-FOOD": 17,
    "B-INST": 19,
    "B-LOC": 5,
    "B-MEDIA": 21,
    "B-MYTH": 23,
    "B-ORG": 3,
    "B-PER": 1,
    "B-PLANT": 25,
    "B-TIME": 27,
    "B-VEHI": 29,
    "I-ANIM": 8,
    "I-BIO": 10,
    "I-CEL": 12,
    "I-DIS": 14,
    "I-EVE": 16,
    "I-FOOD": 18,
    "I-INST": 20,
    "I-LOC": 6,
    "I-MEDIA": 22,
    "I-MYTH": 24,
    "I-ORG": 4,
    "I-PER": 2,
    "I-PLANT": 26,
    "I-TIME": 28,
    "I-VEHI": 30,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "mem_len": null,
  "model_type": "xlnet",
  "n_head": 12,
  "n_layer": 12,
  "pad_token_id": 5,
  "reuse_len": null,
  "same_length": false,
  "start_n_top": 5,
  "summary_activation": "tanh",
  "summary_last_dropout": 0.1,
  "summary_type": "last",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 250
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "untie_r": true,
  "use_mems_eval": true,
  "use_mems_train": false,
  "vocab_size": 32000
}
